Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.media_cf_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "media_cf_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "AllowCloudFrontOACRead"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudfront_distribution.media will be updated in-place
~ resource "aws_cloudfront_distribution" "media" {
        id                              = "E38TFLPKVTD078"
        tags                            = {}
        # (24 unchanged attributes hidden)

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com" -> null
          - origin_access_control_id    = "E13MPCJ2G0S1JT" -> null
          - origin_id                   = "media-s3-origin" -> null
          - response_completion_timeout = 0 -> null
            # (1 unchanged attribute hidden)
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com"
          + origin_access_control_id    = "E13MPCJ2G0S1JT"
          + origin_id                   = "media-s3-origin"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)

          + s3_origin_config {
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_cognito_user_pool.this will be updated in-place
~ resource "aws_cognito_user_pool" "this" {
        id                         = "us-east-2_9oCzdeOZF"
        name                       = "wrestleutopia-user-pool"
        tags                       = {}
        # (18 unchanged attributes hidden)

      ~ lambda_config {
          + pre_sign_up                    = (known after apply)
            # (10 unchanged attributes hidden)
        }

      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "address"
          + required            = false

          + string_attribute_constraints {
              + max_length = "160"
              + min_length = "3"
            }
        }
      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "city"
          + required            = false

          + string_attribute_constraints {
              + max_length = "64"
              + min_length = "1"
            }
        }
      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "country"
          + required            = false

          + string_attribute_constraints {
              + max_length = "64"
              + min_length = "2"
            }
        }
      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "dob"
          + required            = false

          + string_attribute_constraints {
              + max_length = "10"
              + min_length = "10"
            }
        }
      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "orgName"
          + required            = false

          + string_attribute_constraints {
              + max_length = "96"
              + min_length = "1"
            }
        }
      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "region"
          + required            = false

          + string_attribute_constraints {
              + max_length = "64"
              + min_length = "1"
            }
        }
      + schema {
          + attribute_data_type = "String"
          + mutable             = true
          + name                = "stageName"
          + required            = false

          + string_attribute_constraints {
              + max_length = "64"
              + min_length = "1"
            }
        }

        # (9 unchanged blocks hidden)
    }

  # aws_cognito_user_pool_client.web will be updated in-place
~ resource "aws_cognito_user_pool_client" "web" {
        id                                            = "6f4qoincbfm9g0lifod7q8nuhg"
        name                                          = "wrestleutopia-web-client"
      ~ read_attributes                               = [
          + "custom:address",
          + "custom:city",
          + "custom:country",
          + "custom:dob",
          + "custom:orgName",
          + "custom:region",
          + "custom:stageName",
            # (5 unchanged elements hidden)
        ]
      ~ write_attributes                              = [
          + "custom:address",
          + "custom:city",
          + "custom:country",
          + "custom:dob",
          + "custom:orgName",
          + "custom:region",
          + "custom:stageName",
            # (4 unchanged elements hidden)
        ]
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.pre_signup_role will be created
+ resource "aws_iam_role" "pre_signup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "wrestleutopia-pre-signup-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.pre_signup_logs will be created
+ resource "aws_iam_role_policy_attachment" "pre_signup_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::390402544450:policy/wrestleutopia-lambda-logs"
      + role       = "wrestleutopia-pre-signup-role"
    }

  # aws_lambda_function.add_to_group will be updated in-place
~ resource "aws_lambda_function" "add_to_group" {
        id                             = "wrestleutopia-postconfirm-add-to-group"
      ~ last_modified                  = "2025-09-08T17:23:13.979+0000" -> (known after apply)
      ~ source_code_hash               = "oM1dfBavJDNNLXes2OE84yFndhEzTk4YTqHbaCG/V/g=" -> "j7BEGjzEzQMxRTC1J3S3Juxzgo00irb7gbxmCB8UXJc="
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "TABLE_PROMOTERS" = "wrestleutopia-PromoterProfiles"
              + "TABLE_WRESTLERS" = "wrestleutopia-WrestlerProfiles"
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.pre_signup will be created
+ resource "aws_lambda_function" "pre_signup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/pre_signup/pre_signup.zip"
      + function_name                  = "wrestleutopia-pre-signup"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "gwGx9tkXzb0fpP3YcMI+dqa3esh0nbbcqKQWsfPgbLc="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Project"     = "wrestleutopia"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.allow_cognito_presignup will be created
+ resource "aws_lambda_permission" "allow_cognito_presignup" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "wrestleutopia-pre-signup"
      + id                  = (known after apply)
      + principal           = "cognito-idp.amazonaws.com"
      + region              = "us-east-2"
      + source_arn          = "arn:aws:cognito-idp:us-east-2:390402544450:userpool/us-east-2_9oCzdeOZF"
      + statement_id        = "AllowExecutionFromCognitoPreSignUp"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket_policy.media_cf will be updated in-place
~ resource "aws_s3_bucket_policy" "media_cf" {
        id     = "prod-wrestleutopia-media-bucket"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "AllowCloudFrontOACRead"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 5 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 4 to add, 5 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```